import IStrings from "./strings.interface";

const strings: IStrings = {
    Macbook: {
        ru: "Macbook",
        uk: "Macbook",
        en: "Macbook",
    },
    Iphone: {
        ru: "Iphone",
        uk: "Iphone",
        en: "Iphone",
    },
    iPad: {
        ru: "iPad",
        uk: "iPad",
        en: "iPad",
    },
    Сервисы: {
        ru: "Сервисы",
        uk: "Сервіси",
        en: "Services",
    },
    Новинки: {
        ru: "Новинки",
        uk: "Нововведення",
        en: "Novelties",
    },
    "Найдите желаемый гаджет": {
        ru: "Найдите желаемый гаджет",
        uk: "Знайдіть бажаний гаджет",
        en: "Find desired gadget",
    },
    "Найти гаджет": {
        ru: "Найти гаджет",
        uk: "Знайти гаджет",
        en: "Find a gadget",
    },
    "О нас": {
        ru: "О нас",
        uk: "Про нас",
        en: "About us",
    },
    "Посмотреть похожие": {
        ru: "Посмотреть похожие",
        uk: "Подивитися схожі",
        en: "View similar",
    },
    "Мир AppleShop": {
        ru: "Мир AppleShop",
        uk: "Світ AppleShop",
        en: "World AppleShop",
    },
    "Откройте для себя": {
        ru: "Откройте для себя",
        uk: "Відкрийте для себе",
        en: "Discover",
    },
    "как бренд, сервис и компанию на нашем веб-сайте. Здесь вы найдете интересующую вас информацию о":
        {
            ru: "как бренд, сервис и компанию на нашем веб-сайте. Здесь вы найдете интересующую вас информацию о",
            uk: "як бренд, сервіс і компанію на нашій веб-сторінці. Тут ви знайдете цікаву для вас інформацію про",
            en: "as brend, servise and company on our web-page. Here you will find the information you are interested in",
        },
    моделях: {
        ru: "моделях",
        uk: "моделях",
        en: "models",
    },
    "получите поддержку о технологиях и процессе выбора и покупки": {
        ru: "получите поддержку о технологиях и процессе выбора и покупки",
        uk: "отримаєте підтриму про технології та процесі вибору та покупки",
        en: "get support about technology and the selection and purchase process",
    },
    "нового гаджета": {
        ru: "нового гаджета",
        uk: "нового гаджету",
        en: "new gadget",
    },
    "Лет на рынке": {
        ru: "Лет на рынке",
        uk: "Років на ринку",
        en: "Years on market",
    },
    "Купленных гаджетов": {
        ru: "Купленных гаджетов",
        uk: "Придбаних гаджетів",
        en: "Purchased gadgets",
    },
    "Значительная выгода": {
        ru: "Значительная выгода",
        uk: "Значна вигода",
        en: "Significant benefit",
    },
    "Купить прямо сейчас": {
        ru: "Купить прямо сейчас",
        uk: "Придбати прямо зараз",
        en: "Buy right now",
    },
    "Переработанная и развитая система питания от": {
        ru: "Переработанная и развитая система питания от",
        uk: "Перероблена та розвинена система живлення від",
        en: "Reworked and developed power system from",
    },
    чипа: {
        ru: "чипа",
        uk: "чипу",
        en: "chip",
    },
    "выдает турбо мощность": {
        ru: "выдает турбо мощность",
        uk: "видає турбо потужність",
        en: "produces turbo power",
    },
    "в 6x раз": {
        ru: "в 6x раз",
        uk: "у 6x разів",
        en: "6x times",
    },
    "больше чем в intel устройств": {
        ru: "больше чем в intel устройств",
        uk: "більше ніж у intel пристроїв",
        en: "more than intel devices",
    },
    КУПИТЬ: {
        ru: "КУПИТЬ",
        uk: "ПРИДБАТИ",
        en: "BUY",
    },
    Купить: {
        ru: "Купить",
        uk: "Придбати",
        en: "Buy",
    },
    "на базе операционной системы": {
        ru: "на базе операционной системы",
        uk: "на базі операційної системи",
        en: "operating system based on",
    },
    "в 12x раз": {
        ru: "в 12x раз",
        uk: "у 12x разів",
        en: "12x times",
    },
    Новинка: {
        ru: "Новинка",
        uk: "Новинка",
        en: "Novelty",
    },
    Скидка: {
        ru: "Скидка",
        uk: "Скидка",
        en: "Discount",
    },
};

export default strings;
